> In this series, we will cover the basics of `Data Analysis` using Python. The lessons will start growing gradually until forming a concrete analytical mindset for students. This lesson will cover the essentials of Pandas in processing tabular data. 


![Python for Data Analysis](https://i.ibb.co/x2D7Dpk/Python.gif)

# What is Pandas? 
`Pandas` is an open source Python package that is most widely used for data science/data analysis and machine learning tasks. It is built on top of Numpy, which has been previously touched, which provides support for multi-dimensional arrays. As one of the most popular data wrangling packages, Pandas works well with many other data science modules inside the Python ecosystem, and is typically included in every Python distribution. 


Pandas makes it simple to do many of the time consuming, repetitive tasks associated with working with data, including:

* Data cleansing
* Data fill
* Data normalization
* Merges and joins
* Data visualization
* Statistical analysis
* Data inspection
* Loading and saving data

In fact, with Pandas, you can do everything that makes world-leading data scientists vote Pandas as the best data analysis and manipulation tool available.

# Pandas Getting Started

The main powerful point of pandas is its basic data structure, which is `DataFrame`, every tabular format of data will be stored directly as a `DataFrame` which will ease the transforamtion and manipulation of data. 

Also, because we will be mostly intersted in columns and rows as analysts, Pandas also store every column and every row in a `Series` which will also ease the transformation and manipulation on column and row level. 

Lets see the following graph!

![DataFrame & Series](https://i.ibb.co/NVDxVss/pandas.gif)

# Creating a DataFrame

DataFrames can be created of various datatypes but the most straight forward approach is to creat a `DataFrame` from a `Dict` where the keys are the column names and the values are lists. 

Lets try to create the above piece of data.

In [1]:
# Create a dict
fruits_dct = { 'Oranges': [3, 2, 0, 1], 
               'Apples': [0, 3, 7, 2]    
}

To use `pandas` properly, you have to do two things: 

- Install pandas if it's not installed (Kaggle Enviroment has it installed by default)
- Import the package into the current working enviroment. 

Every package in Python is nothing but some code files published online for anyone to use or edit. Importing the package means that you are graping those functions and codes to the current runtime enviroment which will allow you to use any of this code functions, methods, or attributes. To import `pandas` you need to use the following line. 

```Python
import pandas as pd
```

The term `import pandas` is kind of self-explaining but the term `as pd` is just a convention. Something like agreement between people who use pandas to appriviate it as `pd`

Lets create our first `pandas DataFrame` !

In [2]:
# import statment
import pandas as pd

# lets create our dataframe from fruits dct
fruits_df = pd.DataFrame(fruits_dct)

# lets print it
fruits_df

   Oranges  Apples
0        3       0
1        2       3
2        0       7
3        1       2

Lets check its type.

In [3]:
print(type(fruits_df))

<class 'pandas.core.frame.DataFrame'>

As you can see the `DataFrame` is a neat and clean formation of the tabular data which is considering `80%` of the data that we will deal with in general as analysts.

Before diving deep in `pandas`, we need to get ourselves familiar with the structure of every table of data you will see.

# Structure of table

As mentioned before, `80%` of the data we will see are table so, it's crucial to know its structure deeply. 

Lets see the following image: 
    
![Structure of Table](https://i.ibb.co/0s3Gwhj/table-1.jpg)

- `Index` is like an address, that’s how any data point across the dataframe or series can be accessed.
- `Columns` also called as `features` or `fields` are a list of values for the specific thing we are measure. for example, in the snippet we have every value in the `apples` column represents number of apples at that time. 
- `Rows` also called as `observations` or `occurances` are representing every object in our data. for example, here we have 4 rows which means we have 4 differenet counts of apples and oranges.

# Reading Data using Pandas

Pandas can read data from wide range of formats such as:
- CSV files
- Excel files
- JSON files
- SQL Tables
- Pickle files
- Parquet files

Now, and for the sake of analysis, we will read a CSV file that is containing top 1000 in the history of film making according to `IMDB` website. 

Lets see how.

In [4]:
# read csv file
df_movies = pd.read_csv('../input/data-analytics/IMDB-Movie-Data.csv')
# see the data
display(df_movies)
# print its type
display(type(df_movies))

,Title,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,Secret in Their Eyes,996,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
996,Hostel: Part II,997,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
997,Step Up 2: The Streets,998,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
998,Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
999,Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

pandas.core.frame.DataFrame

As you can see, `pandas` is capable of viewing any table in a clean and tidy format of `pandas.core.frame.DataFrame` data type. Now, lets get ourselves familliar with some of pandas basic methods and attributes to explore more about our dataset.

NOTE: `pd.read_csv()` function will be deep dived later on.

# Basic Attributes and Methods
Now, we will demonstrate some of the basic attributes and methods related to pandas.

- `df.info()`: method used for getting information about number of rows, columns, count of not null, memory usage. You can read more about it in the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.info.html)
- `df.head()`: method that views first 5 rows of the dataframe. You can pass any number in the brackets that will represent any number of rows you want to view.
- `df.tail()`: method that views last 5 rows of the dataframe. You can pass any number in the brackets that will represent any number of rows you want to view.
- `df.describe()`: method that can view the summary statistics for numerical columns. You can read more about this in the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.describe.html)
- `df.shape`: attribute that is use to find out the number of rows and columns (Can you remember the same method in `NumPy`?)
- `df.columns`: attribute that is used to view the column names and it's an iterator by default. You can see more in the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.columns.html)

Lets see some code!

In [5]:
df_movies.head()

,Title,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [6]:
# now, we want to view the last 2 rows of the df
df_movies.tail(2)

,Title,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
998,Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
999,Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [7]:
# lets view our columns
df_movies.columns

Index(['Title', 'Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [8]:
df_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Title               1000 non-null   object
 1   Rank                1000 non-null   int64
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

`df.info()` is one of the most useful methods to use when looking to any `DataFrame`
- First line is indicating the datatype, which is `DataFrame` here.
- Second line is indicating the index type and the total number of entries
- Third line is indicating the total number of columns.
- Then we will come to a summerization table that contains every column name, then the not null count and the data type of that column.
- Then we will see a summary of the data types of all columns
- And in the last line we will see the memeory usage of our dataframe


For our `DataFrame`, we have two columns with `Null` values, those columns are `Revenue (Millions)` and `Metascore`

For the purpose of finding the number of `Null` values specifically. We can use the following `isnull()` methods such as following.

In [9]:
# number of all nulls in every column summed
df_movies.isnull().sum()

Title                   0
Rank                    0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

This also validating the our previous findings.

Now, lets see the summary statistics using `df.describe()`

In [10]:
df_movies.describe()

,Rank,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
count,1000.000000,1000.000000,1000.000000,1000.000000,1.000000e+03,872.000000,936.000000
mean,500.500000,2012.783000,113.172000,6.723200,1.698083e+05,82.956376,58.985043
std,288.819436,3.205962,18.810908,0.945429,1.887626e+05,103.253540,17.194757
min,1.000000,2006.000000,66.000000,1.900000,6.100000e+01,0.000000,11.000000
25%,250.750000,2010.000000,100.000000,6.200000,3.630900e+04,13.270000,47.000000
50%,500.500000,2014.000000,111.000000,6.800000,1.107990e+05,47.985000,59.500000
75%,750.250000,2016.000000,123.000000,7.400000,2.399098e+05,113.715000,72.000000
max,1000.000000,2016.000000,191.000000,9.000000,1.791916e+06,936.630000,100.000000

As you can see the `df.describe()` is calculating some summary statistics. Such as `count`, `mean`, `std`, `min`, `max` and the Percentile.

Some column names in the dataset may case some confusing such as `Runtime (Minutes)` and `Revenue (Millions)`. We will try to rename them to `Runtime_in_Minutes` and `Revenue_in_Millions`


- `df.rename()`: method for renaming columns it takes the columns in form of a dict where the old names are keys and the new names are values. Also, it takes an argument called `inplace` when its set to `true` it means that the current changes will be committed to the current dataframe directly.

In [11]:
# rename() :: method ---> for renaming column names
df_movies.rename(columns = {'Runtime (Minutes)' : 'Runtime_in_Minutes', 'Revenue (Millions)': 'Revenue_in_Millions'},
                 inplace = True)
# check the new column names
df_movies.columns

Index(['Title', 'Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime_in_Minutes', 'Rating', 'Votes', 'Revenue_in_Millions',
       'Metascore'],
      dtype='object')

For better display of the column names, we will convert them to lowercase. 

Try to think about a solution before viewing the answer!

In [12]:
# using list comprehensions with column names
# let's try lowering all columns' names in one line of code
df_movies.columns = [column.lower() for column in df_movies.columns]
# check column names
df_movies.columns

Index(['title', 'rank', 'genre', 'description', 'director', 'actors', 'year',
       'runtime_in_minutes', 'rating', 'votes', 'revenue_in_millions',
       'metascore'],
      dtype='object')

# Duplicate Rows Handling

One of the basic checks to do over any dataset is to check for duplicate rows. Here we don't have any duplicate rows so we will try to create this situation manually. 

- `pd.concat()`: it will append any number of dataframes to each other as they are following the same structure. Check the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.concat.html)

We will use this function to artficially add two `df_movies` to one to another to have a situation where every row is existing twice

In [13]:
# to create a dataset with row duplicates let's just douple our movie dataset
df_temp = pd.concat([df_movies, df_movies], axis = 0)
# investigate the shape
df_temp.shape

(2000, 12)

As the shape check says, we have now a new dataframe `df_temp` that is douple the size of `df_movies`. Now, we will sort its rows according to the `title` column to have better look.
- `df.sort_values(by='column_name',axis=1/0, inplace=True/False)`: used to sort a dataframe by a column. Check [documentation](https://pandas.pydata.org/docs/reference/api/pandas.Series.sort_values.html)

NOTE: For any method dealing with pandas that has the argument `axis`, `0` means column level and `1` means row level

In [14]:
# Let's view df_temp sorted
df_temp.sort_values(by='title', axis=0, inplace=True)
df_temp.head()

,title,rank,genre,description,director,actors,year,runtime_in_minutes,rating,votes,revenue_in_millions,metascore
507,(500) Days of Summer,508,"Comedy,Drama,Romance",An offbeat romantic comedy about a woman who d...,Marc Webb,"Zooey Deschanel, Joseph Gordon-Levitt, Geoffre...",2009,95,7.7,398972,32.39,76.0
507,(500) Days of Summer,508,"Comedy,Drama,Romance",An offbeat romantic comedy about a woman who d...,Marc Webb,"Zooey Deschanel, Joseph Gordon-Levitt, Geoffre...",2009,95,7.7,398972,32.39,76.0
118,10 Cloverfield Lane,119,"Drama,Horror,Mystery","After getting in a car accident, a woman is he...",Dan Trachtenberg,"John Goodman, Mary Elizabeth Winstead, John Ga...",2016,104,7.2,192968,71.90,76.0
118,10 Cloverfield Lane,119,"Drama,Horror,Mystery","After getting in a car accident, a woman is he...",Dan Trachtenberg,"John Goodman, Mary Elizabeth Winstead, John Ga...",2016,104,7.2,192968,71.90,76.0
696,10 Years,697,"Comedy,Drama,Romance","The night before their high school reunion, a ...",Jamie Linden,"Channing Tatum, Rosario Dawson, Chris Pratt, J...",2011,100,6.1,19636,0.20,NaN

Now, we will try removing duplicates using the following function: 

- `df.drop_duplicates(subset= [sequence of columns], keep='first/last/False', inplace=True/False)` : 
    For `keep` argument it has the following 3 cases. 
            * 'first' ---> to keep only the first occurace of the row
            * 'last'  ---> to keep the last occurance of the row
            * 'False' ---> to delete any duplicates with any number of occurances

In [15]:
# Now we will try to drop the full-row duplicates
df_temp.drop_duplicates(inplace=True)
# check the shape
df_temp.shape

(1000, 12)

Lets re-create the `df_temp` again to study the effect of the `keep` arguement

In [16]:
# let's create it a temp df
df_temp = pd.concat([df_movies, df_movies], axis = 0)
# check shape
df_temp.shape

(2000, 12)

Now, we'll remove any rows that have any duplicates. that's mean the remaining number of rows will be 0

In [17]:
df_temp.drop_duplicates(inplace=True, keep=False)
# check the shape
df_temp.shape

(0, 12)

# Slicing and Selecting in DataFrames

Always, we will need to select and slice some parts of the DataFrame. The selecting process may be arbitrary, for example, some specific rows and columns or select based on some conditions. 

Now, as our dataframe is consisting of 1000 unique movie, it's better to make our index as the `title` column

- `df.set_index('column_name', inplace=True/False)`: Check [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.set_index.html)

In [18]:
# Let's set the index to the 'title' column first
df_movies.set_index('title',inplace=True)
# Lets see a slice now. 
df_movies.head()

,rank,genre,description,director,actors,year,runtime_in_minutes,rating,votes,revenue_in_millions,metascore
title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

How to select specific rows/columns? 

- `df.loc[]`: used to select specific rows/columns by names using the following syntax : 
    ```Python
    df.loc[rows_range_by_names: columns_range_by_names]
    ```
- `df.iloc[]`: used to select specific rows/columns by number index using the following syntax :
    ```Python
    df.iloc[rows_range_by_numbers: columns_range_by_numbers]
    ```
    
Now, we want to select some info about `Split` movie, starting from `rank` to `actors` columns.

In [19]:
# let's try loc
split_loc0 = df_movies.loc['Split', 'rank': 'actors' ]
# print the split
split_loc0

rank                                                           3
genre                                            Horror,Thriller
description    Three girls are kidnapped by a man with a diag...
director                                      M. Night Shyamalan
actors         James McAvoy, Anya Taylor-Joy, Haley Lu Richar...
Name: Split, dtype: object

Lets try to beatify the output a little bit.

In [20]:
pd.DataFrame(split_loc0).T

,rank,genre,description,director,actors
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar..."

If we want to view all columns for `Split` movie.

In [21]:
split_loc1 = df_movies.loc['Split', :  ]
# print the split
pd.DataFrame(split_loc1).T

,rank,genre,description,director,actors,year,runtime_in_minutes,rating,votes,revenue_in_millions,metascore
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0

We can use another form when using `df.loc[]`.

In [22]:
# Another form of loc
split_loc2 = df_movies.loc['Split']
# print the split
pd.DataFrame(split_loc2).T

,rank,genre,description,director,actors,year,runtime_in_minutes,rating,votes,revenue_in_millions,metascore
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0

We can obrain the same result using `df.iloc[]` . Remember the `Split` movie is ranked 3 which will be 2 when taking 0-indexing into consideration.

In [23]:
# let's try iloc
split_iloc0 = df_movies.iloc[2]
# print the split
pd.DataFrame(split_iloc0).T

,rank,genre,description,director,actors,year,runtime_in_minutes,rating,votes,revenue_in_millions,metascore
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0

Suppose after importing the dataframe we want to work with a subset of it such as `genre` and `rating` columns

In [24]:
df_movies_subset = df_movies[['genre', 'rating']]
# print the head 
df_movies_subset.head()

                                            genre  rating
title
Guardians of the Galaxy   Action,Adventure,Sci-Fi     8.1
Prometheus               Adventure,Mystery,Sci-Fi     7.0
Split                             Horror,Thriller     7.3
Sing                      Animation,Comedy,Family     7.2
Suicide Squad            Action,Adventure,Fantasy     6.2

In [25]:
df_movies_subset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, Guardians of the Galaxy to Nine Lives
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   genre   1000 non-null   object
 1   rating  1000 non-null   float64
dtypes: float64(1), object(1)
memory usage: 55.7+ KB

Suppose your crietira for selection based on datatypes. Like you want to isolate all string columns in a separate dataframe
- `df.select_dtypes(include = [], exclude = [])` :: method for filtering based on datatypes. Check [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.select_dtypes.html)

Now, lets isolate all string columns in a separate dataframe

In [26]:
# include all object columns
df_movies_str = df_movies.select_dtypes(include=['object'])
# Let's view it 
df_movies_str.head()

,genre,description,director,actors
title,,,,
Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S..."
Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa..."
Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar..."
Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma..."
Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D..."

We can validate that using the `df.info()` method.

In [27]:
df_movies_str.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, Guardians of the Galaxy to Nine Lives
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   genre        1000 non-null   object
 1   description  1000 non-null   object
 2   director     1000 non-null   object
 3   actors       1000 non-null   object
dtypes: object(4)
memory usage: 71.4+ KB

All columns of `df_movies_str` are of data type objet, which represents strings.

# Missing Values Handling

Missing values are a common thing to check when exploring any dataframe and they are some handling techniques for them such as the following: 
- Dropping Null Values: When having a realtively small portion of rows with Null values we can simply drop them. 
    - `df.dropna(axis=1/0, inplace=True/False)`: This method will remove any rows with missing values. Check [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.dropna.html)
- Imputation: Some times when the portion of Null values is slightly bigger we can choose some values to add in those Nulls such as the `mean` or `median` value for numerical columns and may be the most or least frequent category for object columns. Sometimes the imputation will be in a systematic way such as the example we will touch now.
    - `df.fillna(value, method='ffill/bfill', inplace='True/False')`: This method will impute any values to the dataframe in place of Null values. Check [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html) 

For applying different scenarios, we will make a copy of the `df_movies` using the following method. 
- `df.copy()`: Create a copy of the dataframe.

In [28]:
# lets create a copy of the `df_movies` 
df_movies_cp = df_movies.copy()

In [29]:
# lets use dropna to remove all rows with Null values
df_movies.dropna(axis = 0 , inplace=True ) 
# lets check with `df.info()`
df_movies.info()

<class 'pandas.core.frame.DataFrame'>
Index: 838 entries, Guardians of the Galaxy to Nine Lives
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   rank                 838 non-null    int64
 1   genre                838 non-null    object
 2   description          838 non-null    object
 3   director             838 non-null    object
 4   actors               838 non-null    object
 5   year                 838 non-null    int64
 6   runtime_in_minutes   838 non-null    int64
 7   rating               838 non-null    float64
 8   votes                838 non-null    int64
 9   revenue_in_millions  838 non-null    float64
 10  metascore            838 non-null    float64
dtypes: float64(3), int64(4), object(4)
memory usage: 78.6+ KB

We have eliminated the problem of missing values in `df_movies`. lets try to handle the `df_movies_cp` using `df.fillna()`

In [30]:
# Remember df_movies_cp has Null columns 
df_movies_cp.isnull().sum()

rank                     0
genre                    0
description              0
director                 0
actors                   0
year                     0
runtime_in_minutes       0
rating                   0
votes                    0
revenue_in_millions    128
metascore               64
dtype: int64

Now we need to figure out some info about the columns we have such as the `mean` or `median` and `pandas` can easily provide this using a wide range of methods that work on both column level and dataframe level such as: 
 
* `sum()`
* `min()` 
* `max()` 
* `count()` 
* `idxmin()` 
* `idxmax()` 
* `mean()`   
* `median()` 
* `std()` 


Lets use `mean`!

In [31]:
# lets find the mean revenue
mean_revenue = df_movies_cp.revenue_in_millions.mean()
# print it
mean_revenue

82.95637614678898

Now, lets use `fillna()` method to fix the problem of revenue column.

In [32]:
df_movies_cp.revenue_in_millions.fillna(mean_revenue, inplace=True)

In [33]:
# check missing 
df_movies_cp.isnull().sum()

rank                    0
genre                   0
description             0
director                0
actors                  0
year                    0
runtime_in_minutes      0
rating                  0
votes                   0
revenue_in_millions     0
metascore              64
dtype: int64

Now, we have fixed the problem of missing values in `revenue_in_millions` column

Sometimes, filling missing values need to follow some pattern. lets see the following example to see. It's taken from `Uber` company.

In [34]:
# read the dataset
uber = pd.read_csv('../input/data-analytics/uber.csv')
# view the head
uber.head(10)

       Date  Hour  Requests  Completes  Supply Hours  Time On Trip  pETA  aETA
0  9/1/2018    11        79         55         42.63         20.43  5.51  7.19
1       NaN    12        73         41         36.43         15.53  5.48  8.48
2       NaN    13        54         50         23.02         17.76  5.07  8.94
3  9/2/2018    11       193        170         64.20         31.47  5.31  6.55
4       NaN    12       258        210         80.28         38.68  4.94  6.08
5       NaN    13       153        107         59.18         23.37  5.14  6.42
6  9/3/2018    11       124         34         30.67         19.65  6.70  8.19
7       NaN    12        78         34         27.02         14.38  6.36  8.01
8       NaN    13        36         15         20.82         12.62  7.82  9.05
9  9/4/2018    11        98         43         29.17         16.55  6.99  8.32

As you can see, we have some missing values in the date column. The dataset is gathered for some days for hour `11`, `12`, and`13` so, it makes more sense to see the date value of the upper row in the rows underneath until finding a new date.

This can be done using the `method` argument for `fillna`. We will use `ffill` which is abbreviation for forward fill.

In [35]:
uber.fillna(method = 'ffill', inplace = True)
# lets view it
uber.head(10)

       Date  Hour  Requests  Completes  Supply Hours  Time On Trip  pETA  aETA
0  9/1/2018    11        79         55         42.63         20.43  5.51  7.19
1  9/1/2018    12        73         41         36.43         15.53  5.48  8.48
2  9/1/2018    13        54         50         23.02         17.76  5.07  8.94
3  9/2/2018    11       193        170         64.20         31.47  5.31  6.55
4  9/2/2018    12       258        210         80.28         38.68  4.94  6.08
5  9/2/2018    13       153        107         59.18         23.37  5.14  6.42
6  9/3/2018    11       124         34         30.67         19.65  6.70  8.19
7  9/3/2018    12        78         34         27.02         14.38  6.36  8.01
8  9/3/2018    13        36         15         20.82         12.62  7.82  9.05
9  9/4/2018    11        98         43         29.17         16.55  6.99  8.32

Now, its in a good format!

# Filtering

Filtering is a common activity in almost analyzing any dataframe. In almost all cases, you will need to apply some filter on the data. 

Now, we need to study the movies directed by `Ridley Scott`. lets see how to apply this filter.

In [36]:
df_movies_ridley_scott = df_movies[df_movies['director'] == 'Ridley Scott']
df_movies_ridley_scott.head(10)

,rank,genre,description,director,actors,year,runtime_in_minutes,rating,votes,revenue_in_millions,metascore
title,,,,,,,,,,,
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
The Martian,103,"Adventure,Drama,Sci-Fi",An astronaut becomes stranded on Mars after hi...,Ridley Scott,"Matt Damon, Jessica Chastain, Kristen Wiig, Ka...",2015,144,8.0,556097,228.43,80.0
Robin Hood,388,"Action,Adventure,Drama","In 12th century England, Robin and his band of...",Ridley Scott,"Russell Crowe, Cate Blanchett, Matthew Macfady...",2010,140,6.7,221117,105.22,53.0
American Gangster,471,"Biography,Crime,Drama","In 1970s America, a detective works to bring d...",Ridley Scott,"Denzel Washington, Russell Crowe, Chiwetel Eji...",2007,157,7.8,337835,130.13,76.0
Exodus: Gods and Kings,517,"Action,Adventure,Drama",The defiant leader Moses rises up against the ...,Ridley Scott,"Christian Bale, Joel Edgerton, Ben Kingsley, S...",2014,150,6.0,137299,65.01,52.0
The Counselor,522,"Crime,Drama,Thriller",A lawyer finds himself in over his head when h...,Ridley Scott,"Michael Fassbender, Penélope Cruz, Cameron Dia...",2013,117,5.3,84927,16.97,48.0
A Good Year,531,"Comedy,Drama,Romance",A British investment broker inherits his uncle...,Ridley Scott,"Russell Crowe, Abbie Cornish, Albert Finney, M...",2006,117,6.9,74674,7.46,47.0
Body of Lies,738,"Action,Drama,Romance",A CIA agent on the ground in Jordan hunts down...,Ridley Scott,"Leonardo DiCaprio, Russell Crowe, Mark Strong,...",2008,128,7.1,182305,39.38,57.0

Check the shape

In [37]:
df_movies_ridley_scott.shape

(8, 11)

`8` movies out of the top 1000 movies are directed by `Ridley Scott`!

Now, let suppose that we want to get all movies directed by `Ridley Scott` or `Cristopher Nolan`.

In [38]:
df_movies_ridley_scott_cristopher_nolan = df_movies[(df_movies['director'] == 'Christopher Nolan') | 
                                                    (df_movies['director'] == 'Ridley Scott')]
# print the subset
df_movies_ridley_scott_cristopher_nolan.head(10)

,rank,genre,description,director,actors,year,runtime_in_minutes,rating,votes,revenue_in_millions,metascore
title,,,,,,,,,,,
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Interstellar,37,"Adventure,Drama,Sci-Fi",A team of explorers travel through a wormhole ...,Christopher Nolan,"Matthew McConaughey, Anne Hathaway, Jessica Ch...",2014,169,8.6,1047747,187.99,74.0
The Dark Knight,55,"Action,Crime,Drama",When the menace known as the Joker wreaks havo...,Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart,Mi...",2008,152,9.0,1791916,533.32,82.0
The Prestige,65,"Drama,Mystery,Sci-Fi",Two stage magicians engage in competitive one-...,Christopher Nolan,"Christian Bale, Hugh Jackman, Scarlett Johanss...",2006,130,8.5,913152,53.08,66.0
Inception,81,"Action,Adventure,Sci-Fi","A thief, who steals corporate secrets through ...",Christopher Nolan,"Leonardo DiCaprio, Joseph Gordon-Levitt, Ellen...",2010,148,8.8,1583625,292.57,74.0
The Martian,103,"Adventure,Drama,Sci-Fi",An astronaut becomes stranded on Mars after hi...,Ridley Scott,"Matt Damon, Jessica Chastain, Kristen Wiig, Ka...",2015,144,8.0,556097,228.43,80.0
The Dark Knight Rises,125,"Action,Thriller",Eight years after the Joker's reign of anarchy...,Christopher Nolan,"Christian Bale, Tom Hardy, Anne Hathaway,Gary ...",2012,164,8.5,1222645,448.13,78.0
Robin Hood,388,"Action,Adventure,Drama","In 12th century England, Robin and his band of...",Ridley Scott,"Russell Crowe, Cate Blanchett, Matthew Macfady...",2010,140,6.7,221117,105.22,53.0
American Gangster,471,"Biography,Crime,Drama","In 1970s America, a detective works to bring d...",Ridley Scott,"Denzel Washington, Russell Crowe, Chiwetel Eji...",2007,157,7.8,337835,130.13,76.0
Exodus: Gods and Kings,517,"Action,Adventure,Drama",The defiant leader Moses rises up against the ...,Ridley Scott,"Christian Bale, Joel Edgerton, Ben Kingsley, S...",2014,150,6.0,137299,65.01,52.0

Also, we can apply more complex filtering conditions. 

Suppose that we want the movies that follow those conditions: 
- movies between 2005 and 2010
- with rating higher than 8
- the total revenue is below the 0.25 percentile

In [39]:
df_movies_multi_filter = df_movies[
    ((df_movies['year'] >= 2005) & (df_movies['year'] <= 2010))
    & (df_movies['rating'] > 8.0)
    & (df_movies['revenue_in_millions'] < df_movies['revenue_in_millions'].quantile(0.25))
]

# Check the contents
df_movies_multi_filter

,rank,genre,description,director,actors,year,runtime_in_minutes,rating,votes,revenue_in_millions,metascore
title,,,,,,,,,,,
3 Idiots,431,"Comedy,Drama",Two friends are searching for their long lost ...,Rajkumar Hirani,"Aamir Khan, Madhavan, Mona Singh, Sharman Joshi",2009,170,8.4,238789,6.52,67.0
The Lives of Others,477,"Drama,Thriller","In 1984 East Berlin, an agent of the secret po...",Florian Henckel von Donnersmarck,"Ulrich Mühe, Martina Gedeck,Sebastian Koch, Ul...",2006,137,8.5,278103,11.28,89.0
Incendies,714,"Drama,Mystery,War",Twins journey to the Middle East to discover t...,Denis Villeneuve,"Lubna Azabal, Mélissa Désormeaux-Poulin, Maxim...",2010,131,8.2,92863,6.86,80.0
Taare Zameen Par,992,"Drama,Family,Music",An eight-year-old boy is thought to be a lazy ...,Aamir Khan,"Darsheel Safary, Aamir Khan, Tanay Chheda, Sac...",2007,165,8.5,102697,1.20,42.0

# Iterating over rows in DataFrame
One of the most repetitive tasks when analysing data is to be able to iterate over rows. This process can be used in creating new insightful columns or even get some analytical insights directly. 

Now, we will list down some of the ways for iterating over rows while measuring the excution time of each. 

for the sake of simplicity, we will use only 100 rows of the `df_movies` dataframe

### 1. `index`

You can simply iterate over the index of the dataframe and access the rows data based on it. lets see how!

In [40]:
df_movies.head()

,rank,genre,description,director,actors,year,runtime_in_minutes,rating,votes,revenue_in_millions,metascore
title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [41]:
# take first 100 rows
df_small = df_movies[:100]
# lets see its shape
df_small.shape

(100, 11)

In [42]:
%%time
for ind in df_small.index:
    print(df_small['director'][ind], df_small['revenue_in_millions'][ind])

James Gunn 333.13
Ridley Scott 126.46
M. Night Shyamalan 138.12
Christophe Lourdelet 270.32
David Ayer 325.02
Yimou Zhang 45.13
Damien Chazelle 151.06
James Gray 8.01
Morten Tyldum 100.01
David Yates 234.02
Theodore Melfi 169.27
Gareth Edwards 532.17
Ron Clements 248.75
Nacho Vigalondo 2.87
Chris Renaud 368.31
Mel Gibson 67.12
Paul Greengrass 162.16
Garth Davis 51.69
Denis Villeneuve 100.5
Stephen Gaghan 7.22
Kenneth Lonergan 47.7
Walt Dohrn 153.69
Roland Emmerich 103.14
Jon Lucas 113.08
Justin Kurzel 54.65
John Hamburg 60.31
Tom Ford 10.64
Bryan Singer 155.33
Tim Miller 363.02
Paul W.S. Anderson 26.84
Anthony Russo 408.08
Christopher Nolan 187.99
Scott Derrickson 232.6
Antoine Fuqua 93.38
Greg Tiernan 97.66
Barry Jenkins 27.85
John Lee Hancock 12.79
Ricardo de Montreuil 4.21
Rob Marshall 241.06
John Madden 3.44
Justin Lin 158.8
J.J. Abrams 936.63
Anna Foerster 30.35
Garry Marshall 32.46
Chad Stahelski 43.0
Christopher Nolan 533.32
Martin Scorsese 7.08
Fede Alvarez 89.21
Thea Sharrock 56.23
Lone Scherfig 3.18
Clint Eastwood 125.07
Zack Snyder 330.25
Tate Taylor 75.31
Sam Taylor-Johnson 166.15
Christopher Nolan 53.08
Matthew Vaughn 128.25
Peter Berg 31.86
George Miller 153.63
Robin Swicord 0.01
Peter Berg 61.28
Robert Zemeckis 40.07
J.A. Bayona 3.73
David Frankel 30.98
Byron Howard 341.26
Gore Verbinski 309.4
Joss Whedon 623.28
Quentin Tarantino 120.52
Gore Verbinski 423.03
Paul Feig 128.34
Christopher Nolan 292.57
Matt Ross 5.88
Martin Scorsese 116.87
David Fincher 167.74
James Wan 350.03
Colin Trevorrow 652.18
Ben Affleck 10.38
James Cameron 760.51
Quentin Tarantino 54.12
Gavin O'Connor 86.2
Denis Villeneuve 60.96
Duncan Jones 47.17
Tate Taylor 169.71
Todd Phillips 43.02
Joss Whedon 458.99
Shane Black 36.25
Makoto Shinkai 4.68
Jeremy Gillespie 0.15
Olivier Assayas 1.29
Martin Scorsese 132.37
Brian Helgeland 1.87
Kenneth Branagh 181.02
Ridley Scott 228.43
Guy Ritchie 45.43
David Mackenzie 26.86
Taylor Hackford 1.66
David Yates 126.59
Alex Garland 25.44
Greg McLean 10.16
Steve McQueen 56.67
Zack Snyder 210.59
CPU times: user 3.79 ms, sys: 0 ns, total: 3.79 ms
Wall time: 3.81 ms

For this method, it took `4.22 ms` to read 100 rows.

### 2.`iterrows()`

`iterrows()` also can be used for iterating over rows. lets see how!

In [43]:
%%time
for index, row in df_small.iterrows():
    print(row["director"], row["revenue_in_millions"])

James Gunn 333.13
Ridley Scott 126.46
M. Night Shyamalan 138.12
Christophe Lourdelet 270.32
David Ayer 325.02
Yimou Zhang 45.13
Damien Chazelle 151.06
James Gray 8.01
Morten Tyldum 100.01
David Yates 234.02
Theodore Melfi 169.27
Gareth Edwards 532.17
Ron Clements 248.75
Nacho Vigalondo 2.87
Chris Renaud 368.31
Mel Gibson 67.12
Paul Greengrass 162.16
Garth Davis 51.69
Denis Villeneuve 100.5
Stephen Gaghan 7.22
Kenneth Lonergan 47.7
Walt Dohrn 153.69
Roland Emmerich 103.14
Jon Lucas 113.08
Justin Kurzel 54.65
John Hamburg 60.31
Tom Ford 10.64
Bryan Singer 155.33
Tim Miller 363.02
Paul W.S. Anderson 26.84
Anthony Russo 408.08
Christopher Nolan 187.99
Scott Derrickson 232.6
Antoine Fuqua 93.38
Greg Tiernan 97.66
Barry Jenkins 27.85
John Lee Hancock 12.79
Ricardo de Montreuil 4.21
Rob Marshall 241.06
John Madden 3.44
Justin Lin 158.8
J.J. Abrams 936.63
Anna Foerster 30.35
Garry Marshall 32.46
Chad Stahelski 43.0
Christopher Nolan 533.32
Martin Scorsese 7.08
Fede Alvarez 89.21
Thea Sharrock 56.23
Lone Scherfig 3.18
Clint Eastwood 125.07
Zack Snyder 330.25
Tate Taylor 75.31
Sam Taylor-Johnson 166.15
Christopher Nolan 53.08
Matthew Vaughn 128.25
Peter Berg 31.86
George Miller 153.63
Robin Swicord 0.01
Peter Berg 61.28
Robert Zemeckis 40.07
J.A. Bayona 3.73
David Frankel 30.98
Byron Howard 341.26
Gore Verbinski 309.4
Joss Whedon 623.28
Quentin Tarantino 120.52
Gore Verbinski 423.03
Paul Feig 128.34
Christopher Nolan 292.57
Matt Ross 5.88
Martin Scorsese 116.87
David Fincher 167.74
James Wan 350.03
Colin Trevorrow 652.18
Ben Affleck 10.38
James Cameron 760.51
Quentin Tarantino 54.12
Gavin O'Connor 86.2
Denis Villeneuve 60.96
Duncan Jones 47.17
Tate Taylor 169.71
Todd Phillips 43.02
Joss Whedon 458.99
Shane Black 36.25
Makoto Shinkai 4.68
Jeremy Gillespie 0.15
Olivier Assayas 1.29
Martin Scorsese 132.37
Brian Helgeland 1.87
Kenneth Branagh 181.02
Ridley Scott 228.43
Guy Ritchie 45.43
David Mackenzie 26.86
Taylor Hackford 1.66
David Yates 126.59
Alex Garland 25.44
Greg McLean 10.16
Steve McQueen 56.67
Zack Snyder 210.59
CPU times: user 8.88 ms, sys: 847 µs, total: 9.73 ms
Wall time: 9.4 ms

It too for this method, `8.09 ms`

### 3.`itertuples()`

Lets see how it could be used!

In [44]:
%%time
for row in df_small.itertuples():
    print(row.director, row.revenue_in_millions)

James Gunn 333.13
Ridley Scott 126.46
M. Night Shyamalan 138.12
Christophe Lourdelet 270.32
David Ayer 325.02
Yimou Zhang 45.13
Damien Chazelle 151.06
James Gray 8.01
Morten Tyldum 100.01
David Yates 234.02
Theodore Melfi 169.27
Gareth Edwards 532.17
Ron Clements 248.75
Nacho Vigalondo 2.87
Chris Renaud 368.31
Mel Gibson 67.12
Paul Greengrass 162.16
Garth Davis 51.69
Denis Villeneuve 100.5
Stephen Gaghan 7.22
Kenneth Lonergan 47.7
Walt Dohrn 153.69
Roland Emmerich 103.14
Jon Lucas 113.08
Justin Kurzel 54.65
John Hamburg 60.31
Tom Ford 10.64
Bryan Singer 155.33
Tim Miller 363.02
Paul W.S. Anderson 26.84
Anthony Russo 408.08
Christopher Nolan 187.99
Scott Derrickson 232.6
Antoine Fuqua 93.38
Greg Tiernan 97.66
Barry Jenkins 27.85
John Lee Hancock 12.79
Ricardo de Montreuil 4.21
Rob Marshall 241.06
John Madden 3.44
Justin Lin 158.8
J.J. Abrams 936.63
Anna Foerster 30.35
Garry Marshall 32.46
Chad Stahelski 43.0
Christopher Nolan 533.32
Martin Scorsese 7.08
Fede Alvarez 89.21
Thea Sharrock 56.23
Lone Scherfig 3.18
Clint Eastwood 125.07
Zack Snyder 330.25
Tate Taylor 75.31
Sam Taylor-Johnson 166.15
Christopher Nolan 53.08
Matthew Vaughn 128.25
Peter Berg 31.86
George Miller 153.63
Robin Swicord 0.01
Peter Berg 61.28
Robert Zemeckis 40.07
J.A. Bayona 3.73
David Frankel 30.98
Byron Howard 341.26
Gore Verbinski 309.4
Joss Whedon 623.28
Quentin Tarantino 120.52
Gore Verbinski 423.03
Paul Feig 128.34
Christopher Nolan 292.57
Matt Ross 5.88
Martin Scorsese 116.87
David Fincher 167.74
James Wan 350.03
Colin Trevorrow 652.18
Ben Affleck 10.38
James Cameron 760.51
Quentin Tarantino 54.12
Gavin O'Connor 86.2
Denis Villeneuve 60.96
Duncan Jones 47.17
Tate Taylor 169.71
Todd Phillips 43.02
Joss Whedon 458.99
Shane Black 36.25
Makoto Shinkai 4.68
Jeremy Gillespie 0.15
Olivier Assayas 1.29
Martin Scorsese 132.37
Brian Helgeland 1.87
Kenneth Branagh 181.02
Ridley Scott 228.43
Guy Ritchie 45.43
David Mackenzie 26.86
Taylor Hackford 1.66
David Yates 126.59
Alex Garland 25.44
Greg McLean 10.16
Steve McQueen 56.67
Zack Snyder 210.59
CPU times: user 2.91 ms, sys: 0 ns, total: 2.91 ms
Wall time: 2.9 ms

`itertuples()` is generally the fastest method when iterating over rows.

### Exercise

As you may have noticed by now, the `genre` column has multiple values in the same row. That's because any movie can be classified to multiple genres. 

Now, the exercise is to loop over the rows, then get all the whole genres in one list then get the count of each genre using `Counter` function from `collections` module.

Lets see how this could be done!

In [45]:
# list to carry all genres
genre_lst = list()
# loop over all rows using itertuples() [the fastest]
for row in df_movies.itertuples():
    # split every genre by the ',' then add this to genre_lst
    genre_lst += row.genre.split(',')

# lets see our list
genre_lst[:20]

['Action',
 'Adventure',
 'Sci-Fi',
 'Adventure',
 'Mystery',
 'Sci-Fi',
 'Horror',
 'Thriller',
 'Animation',
 'Comedy',
 'Family',
 'Action',
 'Adventure',
 'Fantasy',
 'Action',
 'Adventure',
 'Fantasy',
 'Comedy',
 'Drama',
 'Music']

Now, lets count the repetition of every genre in our top 1000 movie.

In [46]:
from collections import Counter

Counter(genre_lst).most_common()

[('Drama', 419),
 ('Action', 277),
 ('Comedy', 250),
 ('Adventure', 244),
 ('Thriller', 148),
 ('Crime', 126),
 ('Romance', 120),
 ('Sci-Fi', 107),
 ('Fantasy', 92),
 ('Horror', 87),
 ('Mystery', 86),
 ('Biography', 67),
 ('Family', 48),
 ('Animation', 45),
 ('History', 25),
 ('Music', 15),
 ('Sport', 15),
 ('War', 10),
 ('Musical', 5),
 ('Western', 4)]

As you can see, `Drama` genre is the most repeated genre in the list of top 1000 movies!

# Creating or Removing columns from DataFrame

As a part of analysing almost any dataframe, you may need to add some new columns that may hold some new insights about the data. 

Lets see various methods for doing that!

### 1.`apply()`

`apply()` function is used to apply some function agnist some axis. Check [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)

Lets say that we will add a new column called `rating_category` which will simply be an indicator over the `rating` column. Any movie with rating above `8` will be considered as a `good` category otherwise, it will be `neutral`

In [47]:
df_movies['rating_category'] = df_movies['rating'].apply(lambda x : 'good' if x >= 8 else 'neutral' )
# let's print the new dataset and see!
df_movies.head(10)

,rank,genre,description,director,actors,year,runtime_in_minutes,rating,votes,revenue_in_millions,metascore,rating_category
title,,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0,good
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0,neutral
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0,neutral
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0,neutral
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0,neutral
The Great Wall,6,"Action,Adventure,Fantasy",European mercenaries searching for black powde...,Yimou Zhang,"Matt Damon, Tian Jing, Willem Dafoe, Andy Lau",2016,103,6.1,56036,45.13,42.0,neutral
La La Land,7,"Comedy,Drama,Music",A jazz pianist falls for an aspiring actress i...,Damien Chazelle,"Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....",2016,128,8.3,258682,151.06,93.0,good
The Lost City of Z,9,"Action,Adventure,Biography","A true-life drama, centering on British explor...",James Gray,"Charlie Hunnam, Robert Pattinson, Sienna Mille...",2016,141,7.1,7188,8.01,78.0,neutral
Passengers,10,"Adventure,Drama,Romance",A spacecraft traveling to a distant colony pla...,Morten Tyldum,"Jennifer Lawrence, Chris Pratt, Michael Sheen,...",2016,116,7.0,192177,100.01,41.0,neutral
Fantastic Beasts and Where to Find Them,11,"Adventure,Family,Fantasy",The adventures of writer Newt Scamander in New...,David Yates,"Eddie Redmayne, Katherine Waterston, Alison Su...",2016,133,7.5,232072,234.02,66.0,neutral

### 2.`insert()`
`insert()` function used to insert some values, usually list, in a specific position of a dataframe. Check [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.insert.html)

### Excercise

For the current dataset, I have an assumption that the long movies are the most profitable to validate that I will create a new colum based on the values of `runtime_in_minutes` and `revenue_in_millions` columns. 

We will iterate over the dataframe, then put all values in list, and finally insert this column using `df.insert()` function.

In [48]:
lng_prof_lst = list()
for row in df_movies.itertuples():
    # split every genre by the ',' then add this to genre_lst
    if row.runtime_in_minutes > 120 and row.revenue_in_millions > 100:
        lng_prof_lst.append('long_profitable')
    elif row.runtime_in_minutes < 120 and row.revenue_in_millions > 100:
        lng_prof_lst.append('short_profitable')
    elif row.runtime_in_minutes > 120 and row.revenue_in_millions < 100:
        lng_prof_lst.append('long_unprofitable')
    else:
        lng_prof_lst.append('short_unprofitable')

# lets view the list
lng_prof_lst[:20]

['long_profitable',
 'long_profitable',
 'short_profitable',
 'short_profitable',
 'long_profitable',
 'short_unprofitable',
 'long_profitable',
 'long_unprofitable',
 'short_profitable',
 'long_profitable',
 'long_profitable',
 'long_profitable',
 'short_profitable',
 'short_unprofitable',
 'short_profitable',
 'long_unprofitable',
 'long_profitable',
 'short_unprofitable',
 'short_profitable',
 'short_unprofitable']

Perfect! lets append our list to the dataframe now!

In [49]:
df_movies.insert(1, "long_profitable_flg", lng_prof_lst)
# lets see our dataframe now.
df_movies.head(10)

,rank,long_profitable_flg,genre,description,director,actors,year,runtime_in_minutes,rating,votes,revenue_in_millions,metascore,rating_category
title,,,,,,,,,,,,,
Guardians of the Galaxy,1,long_profitable,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0,good
Prometheus,2,long_profitable,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0,neutral
Split,3,short_profitable,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0,neutral
Sing,4,short_profitable,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0,neutral
Suicide Squad,5,long_profitable,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0,neutral
The Great Wall,6,short_unprofitable,"Action,Adventure,Fantasy",European mercenaries searching for black powde...,Yimou Zhang,"Matt Damon, Tian Jing, Willem Dafoe, Andy Lau",2016,103,6.1,56036,45.13,42.0,neutral
La La Land,7,long_profitable,"Comedy,Drama,Music",A jazz pianist falls for an aspiring actress i...,Damien Chazelle,"Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....",2016,128,8.3,258682,151.06,93.0,good
The Lost City of Z,9,long_unprofitable,"Action,Adventure,Biography","A true-life drama, centering on British explor...",James Gray,"Charlie Hunnam, Robert Pattinson, Sienna Mille...",2016,141,7.1,7188,8.01,78.0,neutral
Passengers,10,short_profitable,"Adventure,Drama,Romance",A spacecraft traveling to a distant colony pla...,Morten Tyldum,"Jennifer Lawrence, Chris Pratt, Michael Sheen,...",2016,116,7.0,192177,100.01,41.0,neutral
Fantastic Beasts and Where to Find Them,11,long_profitable,"Adventure,Family,Fantasy",The adventures of writer Newt Scamander in New...,David Yates,"Eddie Redmayne, Katherine Waterston, Alison Su...",2016,133,7.5,232072,234.02,66.0,neutral

To have some deeper insights. lets use a new function:

* `df[column].value_counts()`: this method can count every category in a dataframe. It can has an argument called `normalize` when its true the result will be in percentage. Check [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.value_counts.html)

In [50]:
df_movies['long_profitable_flg'].value_counts()

short_unprofitable    454
long_unprofitable     142
short_profitable      123
long_profitable       119
Name: long_profitable_flg, dtype: int64

In [51]:
df_movies['long_profitable_flg'].value_counts(normalize=True)

short_unprofitable    0.541766
long_unprofitable     0.169451
short_profitable      0.146778
long_profitable       0.142005
Name: long_profitable_flg, dtype: float64

Our assumption is not true, `54%` of the movies are short unprofitable.

Of course, you will need to remove some columns sometimes. This can be done using the following function. 

* `df.drop('column name', axis=1/0, inplace=True)`: The function is pretty easy but just in case, you can check [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop.html)

Now, we will use it to drop `metascore` column

In [52]:
df_movies.drop('metascore', axis=1, inplace=True)
df_movies.columns

Index(['rank', 'long_profitable_flg', 'genre', 'description', 'director',
       'actors', 'year', 'runtime_in_minutes', 'rating', 'votes',
       'revenue_in_millions', 'rating_category'],
      dtype='object')

It worked!

# Data Reshaping

In the field of data analysis, reshaping a pandas dataframe is one of the most popular data wrangling activities. Changing a table's format from long to wide or from wide to long is also known as transposing, pivoting, or unpivoting.

But what is the difference between long and wide format. Lets see the following figure!


![Wide and Long Format](https://i.ibb.co/8c2RtmH/data-reshaping.jpg)


The above figure is showing the difference between `wide` and `long` format of data. Although, both tables are giving the exact same information but they are formating in different ways!

**So, what is the correct format when doing data analysis? Is it `wide` or `long`?** 

There's no right or wrong regarding this point. You may use whatever version you want but you have to fulfill two main aspects. 
* `Usability`: you have to think about what is the usability of the data on its current state. For example, if you were given a very wide formatted table with 300 columns, one column for each date in the observation period. Will this be a good form for representing such data? In this format, you are missing alot of insights such as plotting those 300 date vs. any other quantity! So, converting such case to long may enhance the usability of the data. 

* `Readablity`: also, you have to think if your data is readable and easy to understand enough or not. For example, if you were given a very long formatted table with 300 different value for key. Would it be better to deal with such format? or have every key as a separate column? It's obvious that such case is better to be converted also to wide format. 

**How to convert from the `wide` to `long` format?**
* `pd.melt(df, id_vars=[column_names], value_vars=[column_names], var_name='name', value_name = 'name')`
    * `id_vars`: list of columns that will not change from the wide to long format
    * `value_vars`: list of columns that will be converted to values from the wide to long.
    * `var_name`: the key column name when converting.
    * `value_name`: the value column name during converting.
Also, make sure to check its [documentation](https://pandas.pydata.org/docs/reference/api/pandas.melt.html)

**How to convert from the `long` to `wide` format?**
* `pd.pivot_table(df, index=['column_names'], columns= 'column_name', values = 'column_name`, aggfunc)`
    * `index`: column that will remain the same from long to wide.
    * `columns`: column name that will be prodcasted into new column names in the wide format. 
    * `values`: column that will be used as a value for all corresponding categories in the `columns` agrgument. 
    * `aggfunc`: it may be used when squeezing multible occurances of the same category.
Also, make sure to check its [documentation](https://pandas.pydata.org/docs/reference/api/pandas.pivot_table.html)

Now, lets see all of those in action using some data!

Lets define a simple dataframe to see how `pd.melt()` is working!

In [53]:
# Define a dict that contains the data above
data = {'Name': ['John', 'Smith', 'Liz',], 
        'Weight': [150, 170, 110], 
        'BP': [120, 130, 100]}
# Let's create a wide DataFrame
df_wide = pd.DataFrame(data)
# Let's print 
df_wide

    Name  Weight   BP
0   John     150  120
1  Smith     170  130
2    Liz     110  100

Now, lets convert the above dataframe inot wide format and see.

In [54]:
df_long = df_wide.melt(id_vars='Name', var_name='key', value_name='value')
# print to check
df_long

    Name     key  value
0   John  Weight    150
1  Smith  Weight    170
2    Liz  Weight    110
3   John      BP    120
4  Smith      BP    130
5    Liz      BP    100

Now, you may have got a good idea about how `pd.melt()` is working.

For more conveniance, we will start reading a new dataframe. That is called `gapminder` which is gathering some info about different countries such as `gdp per capita`, `life Expectency`, and `Population`

For this dataset, we have its `url` and yes, pandas can read directly from the `url`!

In [55]:
data_url = "https://goo.gl/ioc2Td"
gapminder = pd.read_csv(data_url)
gapminder.head(3)

,continent,country,gdpPercap_1952,gdpPercap_1957,gdpPercap_1962,gdpPercap_1967,gdpPercap_1972,gdpPercap_1977,gdpPercap_1982,gdpPercap_1987,...,pop_1962,pop_1967,pop_1972,pop_1977,pop_1982,pop_1987,pop_1992,pop_1997,pop_2002,pop_2007
0,Africa,Algeria,2449.008185,3013.976023,2550.816880,3246.991771,4182.663766,4910.416756,5745.160213,5681.358539,...,11000948.0,12760499.0,14760787.0,17152804.0,20033753.0,23254956.0,26298373.0,29072015.0,31287142,33333216
1,Africa,Angola,3520.610273,3827.940465,4269.276742,5522.776375,5473.288005,3008.647355,2756.953672,2430.208311,...,4826015.0,5247469.0,5894858.0,6162675.0,7016384.0,7874230.0,8735988.0,9875024.0,10866106,12420476
2,Africa,Benin,1062.752200,959.601080,949.499064,1035.831411,1085.796879,1029.161251,1277.897616,1225.856010,...,2151895.0,2427334.0,2761407.0,3168267.0,3641603.0,4243788.0,4981671.0,6066080.0,7026113,8078314

Let's view the columns for `gapminder`

In [56]:
gapminder.columns

Index(['continent', 'country', 'gdpPercap_1952', 'gdpPercap_1957',
       'gdpPercap_1962', 'gdpPercap_1967', 'gdpPercap_1972', 'gdpPercap_1977',
       'gdpPercap_1982', 'gdpPercap_1987', 'gdpPercap_1992', 'gdpPercap_1997',
       'gdpPercap_2002', 'gdpPercap_2007', 'lifeExp_1952', 'lifeExp_1957',
       'lifeExp_1962', 'lifeExp_1967', 'lifeExp_1972', 'lifeExp_1977',
       'lifeExp_1982', 'lifeExp_1987', 'lifeExp_1992', 'lifeExp_1997',
       'lifeExp_2002', 'lifeExp_2007', 'pop_1952', 'pop_1957', 'pop_1962',
       'pop_1967', 'pop_1972', 'pop_1977', 'pop_1982', 'pop_1987', 'pop_1992',
       'pop_1997', 'pop_2002', 'pop_2007'],
      dtype='object')

You can notice that the dataset is in a very wide format and each column gives the values for a specific year which is not a very good format when analysing such dataset. 

For this, we will start by separting all the `gdpPercap` columns with `continent` and `country` because they are both considered indexes.

Lets see how!

In [57]:
gdpPercap = gapminder.loc[:, gapminder.columns.str.contains('^gdp|^c')]
# Print the head
gdpPercap.head(3)

,continent,country,gdpPercap_1952,gdpPercap_1957,gdpPercap_1962,gdpPercap_1967,gdpPercap_1972,gdpPercap_1977,gdpPercap_1982,gdpPercap_1987,gdpPercap_1992,gdpPercap_1997,gdpPercap_2002,gdpPercap_2007
0,Africa,Algeria,2449.008185,3013.976023,2550.816880,3246.991771,4182.663766,4910.416756,5745.160213,5681.358539,5023.216647,4797.295051,5288.040382,6223.367465
1,Africa,Angola,3520.610273,3827.940465,4269.276742,5522.776375,5473.288005,3008.647355,2756.953672,2430.208311,2627.845685,2277.140884,2773.287312,4797.231267
2,Africa,Benin,1062.752200,959.601080,949.499064,1035.831411,1085.796879,1029.161251,1277.897616,1225.856010,1191.207681,1232.975292,1372.877931,1441.284873

In [58]:
gdpPercap.shape

(142, 14)

Pandas `Series.str.contains()` function is used to test if pattern or regex is contained within a string of a Series or Index. 

Regular Expression or Regex for short is the part of `^gdp|^c`. Regex is used in general for text parsing and it has some strict rules. If you want to get the correct regex for the text you want to catch in a more fun way. You can use [AutoRegex](https://www.autoregex.xyz/) which is an AI translator between plain English text and regex. 

For example, to be able to catch the columns starts with `C` and the word `gdp`, I entered *capture anything starts with the letter c or the word 'gdp'*

Now, lets use `pd.melt()` to get a better format for `gdpPercap` dataframe.

In [59]:
# Let's convert it from this very wide format to a long one
gdpPercap_tidy = gdpPercap.melt(id_vars=['continent', 'country'], var_name='year', value_name = 'gdpPercap')
gdpPercap_tidy.head(3)

  continent  country            year    gdpPercap
0    Africa  Algeria  gdpPercap_1952  2449.008185
1    Africa   Angola  gdpPercap_1952  3520.610273
2    Africa    Benin  gdpPercap_1952  1062.752200

In [60]:
gdpPercap_tidy.shape

(1704, 4)

As you can see, the format is much better except for the year colum that we will try to fix right now. Also, notice that converting wide format to long will result in an increase in the number of rows and decrease in the number of columns.

For the values in the year column such as `gdpPercap_1952` needs to be `1952`. To fix this we will create a function called `keep_year` that takes in any text mixed with numbers and return only numbers.

In [61]:
def keep_year(text):
    clean_text = ''.join([item for item in text if item.isdigit()])
    return clean_text

Let's test our function before applying to the dataframe

In [62]:
keep_year('some_text_and_all_this_about_1994')

'1994'

Perfect!  let's apply it to our dataset

In [63]:
# apply the function to the year column
gdpPercap_tidy['year'] = gdpPercap_tidy['year'].apply(keep_year)
# let's see the result!
gdpPercap_tidy.head()

  continent       country  year    gdpPercap
0    Africa       Algeria  1952  2449.008185
1    Africa        Angola  1952  3520.610273
2    Africa         Benin  1952  1062.752200
3    Africa      Botswana  1952   851.241141
4    Africa  Burkina Faso  1952   543.255241

This is a perfect format but to make sure lets check about the data types of columns.

In [64]:
gdpPercap_tidy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   continent  1704 non-null   object
 1   country    1704 non-null   object
 2   year       1704 non-null   object
 3   gdpPercap  1704 non-null   float64
dtypes: float64(1), object(3)
memory usage: 53.4+ KB

The `year` column is in `object` format so, it need to be converted to `int`. 

Lets do it!

In [65]:
# convert the `year` column to numeric
gdpPercap_tidy.year = pd.to_numeric(gdpPercap_tidy.year)
# check the data types
gdpPercap_tidy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   continent  1704 non-null   object
 1   country    1704 non-null   object
 2   year       1704 non-null   int64
 3   gdpPercap  1704 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 53.4+ KB

Now, lets repeat all the previous steps with `lifeExp` and `pop` columns

In [66]:
# preparing lifeExp dataframe
lifeExp = gapminder.loc[:, gapminder.columns.str.contains('^life|^c')]
# melt the dataframe.
lifeExp_tidy = lifeExp.melt(id_vars=['continent', 'country'], var_name='year', value_name = 'lifeExp')
# fix the year column
lifeExp_tidy.year = lifeExp_tidy.year.apply(keep_year)
# convert the year column to numeric
lifeExp_tidy.year = pd.to_numeric(lifeExp_tidy.year)
# display the data itself
display(lifeExp_tidy.head())
# display info
display(lifeExp_tidy.info())

  continent       country  year  lifeExp
0    Africa       Algeria  1952   43.077
1    Africa        Angola  1952   30.015
2    Africa         Benin  1952   38.223
3    Africa      Botswana  1952   47.622
4    Africa  Burkina Faso  1952   31.975

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   continent  1704 non-null   object
 1   country    1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 53.4+ KB

None

Perfect! lets do the same for `pop` columns!

In [67]:
# preparing pop dataframe
pop = gapminder.loc[:, gapminder.columns.str.contains('^pop|^c')]
# melt the dataframe.
pop_tidy = pop.melt(id_vars=['continent', 'country'], var_name='year', value_name = 'pop')
# fix the year column
pop_tidy.year = pop_tidy.year.apply(keep_year)
# convert the year column to numeric
pop_tidy.year = pd.to_numeric(pop_tidy.year)
# display the data itself
display(pop_tidy.head())
# display info
display(pop_tidy.info())

  continent       country  year        pop
0    Africa       Algeria  1952  9279525.0
1    Africa        Angola  1952  4232095.0
2    Africa         Benin  1952  1738315.0
3    Africa      Botswana  1952   442308.0
4    Africa  Burkina Faso  1952  4469979.0

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   continent  1704 non-null   object
 1   country    1704 non-null   object
 2   year       1704 non-null   int64
 3   pop        1704 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 53.4+ KB

None

Now, we need to combine all those three dataframes in one `gdpPercap_tidy`, `lifeExp_tidy`, and `pop_tidy`. 

We can use `pd.concat()` for this task but this time to stack those dataframes vertically.

In [68]:
gapminder_final = pd.concat([gdpPercap_tidy, lifeExp_tidy, pop_tidy],sort=True, axis=1)
# check 
gapminder_final.head(10)

,continent,country,year,gdpPercap,continent,country,year,lifeExp,continent,country,year,pop
0,Africa,Algeria,1952,2449.008185,Africa,Algeria,1952,43.077,Africa,Algeria,1952,9279525.0
1,Africa,Angola,1952,3520.610273,Africa,Angola,1952,30.015,Africa,Angola,1952,4232095.0
2,Africa,Benin,1952,1062.752200,Africa,Benin,1952,38.223,Africa,Benin,1952,1738315.0
3,Africa,Botswana,1952,851.241141,Africa,Botswana,1952,47.622,Africa,Botswana,1952,442308.0
4,Africa,Burkina Faso,1952,543.255241,Africa,Burkina Faso,1952,31.975,Africa,Burkina Faso,1952,4469979.0
5,Africa,Burundi,1952,339.296459,Africa,Burundi,1952,39.031,Africa,Burundi,1952,2445618.0
6,Africa,Cameroon,1952,1172.667655,Africa,Cameroon,1952,38.523,Africa,Cameroon,1952,5009067.0
7,Africa,Central African Republic,1952,1071.310713,Africa,Central African Republic,1952,35.463,Africa,Central African Republic,1952,1291695.0
8,Africa,Chad,1952,1178.665927,Africa,Chad,1952,38.092,Africa,Chad,1952,2682462.0
9,Africa,Comoros,1952,1102.990936,Africa,Comoros,1952,40.715,Africa,Comoros,1952,153936.0

Obviouslly, this is not the required result! we have duplicate columns!, how to handle this in a ONE LINE OF CODE?

In [69]:
gapminder_final = gapminder_final.T.drop_duplicates().T
# Let's check!
gapminder_final.head()
# Done!!

  continent       country  year    gdpPercap lifeExp        pop
0    Africa       Algeria  1952  2449.008185  43.077  9279525.0
1    Africa        Angola  1952  3520.610273  30.015  4232095.0
2    Africa         Benin  1952    1062.7522  38.223  1738315.0
3    Africa      Botswana  1952   851.241141  47.622   442308.0
4    Africa  Burkina Faso  1952   543.255241  31.975  4469979.0

Now, our dataframe is finally clean and tidy!

Now, we want to apply more in transforming long dataframes to wide by using `pd.pivot()`. To do this, we will take a supset of the `gapminder` dataset

In [70]:
gm_df = gapminder_final[['continent','year','lifeExp']].copy()
# lets print it
gm_df.head()

  continent  year lifeExp
0    Africa  1952  43.077
1    Africa  1952  30.015
2    Africa  1952  38.223
3    Africa  1952  47.622
4    Africa  1952  31.975

In [71]:
# check the datatype for each column
gm_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1704 entries, 0 to 1703
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   continent  1704 non-null   object
 1   year       1704 non-null   object
 2   lifeExp    1704 non-null   object
dtypes: object(3)
memory usage: 117.8+ KB

We need to convert `lifeExp` and `year` to numerical type.

In [72]:
# convert year column
gm_df.year = pd.to_numeric(gm_df.year)
# convert lifeExp column
gm_df.lifeExp = pd.to_numeric(gm_df.lifeExp)
# lets check info
gm_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1704 entries, 0 to 1703
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   continent  1704 non-null   object
 1   year       1704 non-null   int64
 2   lifeExp    1704 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 117.8+ KB

Now, we will try to use `pd.pivot()`

In [73]:
# lets import numpy
import numpy as np
# pivot
p_df_1 = pd.pivot_table(gm_df, values='lifeExp', columns='continent', aggfunc=np.mean)
# Let's print it
p_df_1

continent    Africa   Americas       Asia     Europe    Oceania
lifeExp    48.86533  64.658737  60.064903  71.903686  74.326208

for our long dataset, we tried to summerize it using `pd.pivot_table()`. We choosed that the categories (values) in the `continent` column to be broadcasted as columns and the values to be taken from the `lifeExp` column (passed to values argument) and because we have multiple values for `lifeExp` that correspond to each `continenet` we had to choose some aggregation function to be applied in the way of the transforamation. Here, we choose the `np.mean()` which means that we will be the mean (average) `lifeExp` for each `continent`

Lets try to use `pd.pivot_table()` in a different way!

In [74]:
p_df_2 = pd.pivot_table(gm_df, values='lifeExp', 
                     index=['year'], 
                     columns='continent', 
                     aggfunc=np.mean)
# check the table
p_df_2.head()

continent     Africa  Americas       Asia     Europe  Oceania
year
1952       39.135500  53.27984  46.314394  64.408500   69.255
1957       41.266346  55.96028  49.318544  66.703067   70.295
1962       43.319442  58.39876  51.563223  68.539233   71.085
1967       45.334538  60.41092  54.663640  69.737600   71.310
1972       47.450942  62.39492  57.319269  70.775033   71.910

Here we used `pd.pivot_table()` in a different way. The `year` column will be an index and the categories in `continent` column are broadcasted into columns. So, this table is giving the average `lifeExp` per continent per year.

# Grouping
Any groupby operation involves one of the following operations on the original dataframe. They are −

* Splitting the dataframe
* Applying a function
* Combining the results

The basic syntax for grouping in pandas. 
```Python
    df.groupby(by=None, axis=0, as_index=True, sort=True, dropna=True)
```
The basic argument is `by` which is the column that we will be grouping over. All other argument are almost self explantory. 

When we use `.groupby()` function on any categorical column of dataframe, it returns a `GroupBy` object. Then we can use various methods on this object and even aggregate other columns to get the summarized view of the dataset.

For now, we will read a new dataframe `sales_data` to apply some concepts about `grouping`.

In [75]:
# read the dataset
sales_df = pd.read_csv('../input/data-analytics/sales_data.csv')
# view head
display(sales_df.head())
# view info
display(sales_df.info())

,OrderID,Quantity,UnitPrice(USD),Status,OrderDate,Product_Category,Sales_Manager,Shipping_Cost(USD),Delivery_Time(Days),Shipping_Address,Product_Code,OrderCode
0,2.951110e+18,92,238,Not Delivered,8/8/2021,Healthcare,Pablo,21,25.0,Singapore,HC-188,444116
1,2.181910e+18,61,136,Not Delivered,10/3/2021,Office,Pablo,34,14.0,UK,O-555,444772
2,3.239110e+18,67,235,Not Delivered,9/27/2021,Office,Kristen,25,11.0,Kenya,O-188,444666
3,1.112610e+18,33,133,Not Shipped,7/30/2021,Fashion,Abdul,34,24.0,USA,F-555,444007
4,1.548310e+18,13,189,Not Delivered,8/15/2021,Fashion,Stella,24,19.0,Kenya,F-555,444223

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9999 entries, 0 to 9998
Data columns (total 12 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   OrderID              9999 non-null   float64
 1   Quantity             9999 non-null   int64
 2   UnitPrice(USD)       9999 non-null   int64
 3   Status               9999 non-null   object
 4   OrderDate            9999 non-null   object
 5   Product_Category     9963 non-null   object
 6   Sales_Manager        9999 non-null   object
 7   Shipping_Cost(USD)   9999 non-null   int64
 8   Delivery_Time(Days)  9948 non-null   float64
 9   Shipping_Address     9999 non-null   object
 10  Product_Code         9999 non-null   object
 11  OrderCode            9999 non-null   int64
dtypes: float64(2), int64(4), object(6)
memory usage: 937.5+ KB

None

In [76]:
sales_gp_df = sales_df.groupby("Product_Category")
type(sales_gp_df)

pandas.core.groupby.generic.DataFrameGroupBy

You can see that when grouping over the `Product_Category`. It returns a `GroupBy` object which is nothing but a dictionary where keys are the unique groups in which records are split and values are the columns of each group which are not mentioned in groupby.

Certainly, `GroupBy` object holds contents of entire DataFrame but in more structured form. And just like dictionaries there are several methods to get the required data efficiently.

Lets try to validate it!

In [77]:
sales_df.Product_Category.nunique()

5

We have `5` differnet categories into the `Product_Category`. Lets see the number of groups.

In [78]:
sales_gp_df.ngroups

5

Also, for the `GroupBy` object we have `5` groups. 

For now, lets try to get the average `UnitPrice(USD)` per `Product_Category` and see how this is working.

In [79]:
# we will first perform the groupby then get the mean unit price.
sales_df.groupby("Product_Category")['UnitPrice(USD)'].mean().reset_index()

  Product_Category  UnitPrice(USD)
0    Entertainment      176.038618
1          Fashion      176.117199
2       Healthcare      175.489503
3             Home      175.354854
4           Office      175.127300

Different aggregate functions can be used with grouping. Lets try to get median `Shipping_Cost(USD)` per `Product_Category`

In [80]:
sales_df.groupby("Product_Category")['Shipping_Cost(USD)'].median().reset_index()

  Product_Category  Shipping_Cost(USD)
0    Entertainment                28.0
1          Fashion                28.0
2       Healthcare                27.0
3             Home                28.0
4           Office                28.0

Grouping also can work on multi-level! Suppose, that we want to get the average `Delivery_Time(Days)` per `Product_Category` per `Sales_Manager`. 

Lets see how!

In [81]:
sales_df.groupby(['Product_Category', 'Sales_Manager'])['Delivery_Time(Days)'].mean().reset_index()

   Product_Category Sales_Manager  Delivery_Time(Days)
0     Entertainment         Abdul            17.806452
1     Entertainment       Anthony            17.518135
2     Entertainment          Emma            17.400000
3     Entertainment         Jacob            17.524324
4     Entertainment          John            17.510204
5     Entertainment       Kristen            17.525510
6     Entertainment         Maria            17.312139
7     Entertainment         Pablo            17.247423
8     Entertainment         Sofia            17.299465
9     Entertainment        Stella            17.714286
10          Fashion         Abdul            17.568627
11          Fashion       Anthony            16.979592
12          Fashion          Emma            17.467033
13          Fashion         Jacob            17.386243
14          Fashion          John            17.347280
15          Fashion       Kristen            17.373626
16          Fashion         Maria            17.928230
17          Fashion         Pablo            17.495283
18          Fashion         Sofia            17.675978
19          Fashion        Stella            17.169591
20       Healthcare         Abdul            17.336957
21       Healthcare       Anthony            18.202970
22       Healthcare          Emma            17.542373
23       Healthcare         Jacob            17.303665
24       Healthcare          John            17.555556
25       Healthcare       Kristen            17.053476
26       Healthcare         Maria            17.584699
27       Healthcare         Pablo            17.056701
28       Healthcare         Sofia            18.049774
29       Healthcare        Stella            17.827225
30             Home         Abdul            17.888268
31             Home       Anthony            17.469194
32             Home          Emma            17.504762
33             Home         Jacob            17.193237
34             Home          John            17.685714
35             Home       Kristen            17.630841
36             Home         Maria            18.285714
37             Home         Pablo            17.025126
38             Home         Sofia            17.730435
39             Home        Stella            17.615000
40           Office         Abdul            17.457447
41           Office       Anthony            17.378641
42           Office          Emma            17.481651
43           Office         Jacob            17.408377
44           Office          John            17.552511
45           Office       Kristen            17.876238
46           Office         Maria            18.105556
47           Office         Pablo            17.449495
48           Office         Sofia            17.308901
49           Office        Stella            17.023697

Grouping in pandas can work with multiple aggregate functions. For example, imagine that we want to get the sum, mean, median, standard deviation,and maximum `Shipping_Cost(USD)` for every `Product_Category`

In [82]:
sales_df.groupby("Product_Category")['Shipping_Cost(USD)'].agg([np.sum, np.mean, np.median, np.std, max, len]).reset_index()

  Product_Category    sum       mean  median       std  max   len
0    Entertainment  54277  27.579776    28.0  4.646282   35  1968
1          Fashion  54568  27.685439    28.0  4.603958   35  1971
2       Healthcare  53745  27.519201    27.0  4.610302   35  1953
3             Home  56728  27.537864    28.0  4.550939   35  2060
4           Office  55347  27.522128    28.0  4.642962   35  2011

`.agg()` function can add a lot of flexiability when aggregating using different aggregate functions. Check [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.agg.html)

We can use `.agg()` to multiple columns. For example, we want to get the median of `Shipping_Cost(USD)` and the standard deviation of `Quantity` for every `Product_Category`. 

Lets see how!

In [83]:
# aggregates dict
f = {'Shipping_Cost(USD)': [np.mean], 'Quantity': [np.std]}
# pass this dict to GroupBy
sales_df.groupby("Product_Category").agg(f).reset_index()

  Product_Category Shipping_Cost(USD)   Quantity
                                 mean        std
0    Entertainment          27.579776  29.184244
1          Fashion          27.685439  28.687947
2       Healthcare          27.519201  29.265929
3             Home          27.537864  28.917479
4           Office          27.522128  28.983277

As you can see, different aggreagate funtions can be applied to different columns!

In additon to that, some useful funtions can be used with `GroupBy` for example you can get the first and last row in each category. Lets see how!

In [84]:
sales_df.groupby("Product_Category").first()

,OrderID,Quantity,UnitPrice(USD),Status,OrderDate,Sales_Manager,Shipping_Cost(USD),Delivery_Time(Days),Shipping_Address,Product_Code,OrderCode
Product_Category,,,,,,,,,,,
Entertainment,4.934810e+18,51,204,Not Delivered,11/13/2021,Abdul,32,18.0,UK,ENT-188,445113
Fashion,1.112610e+18,33,133,Not Shipped,7/30/2021,Abdul,34,24.0,USA,F-555,444007
Healthcare,2.951110e+18,92,238,Not Delivered,8/8/2021,Pablo,21,25.0,Singapore,HC-188,444116
Home,4.337210e+18,57,226,Not Shipped,9/27/2021,John,24,14.0,UK,H-555,444666
Office,2.181910e+18,61,136,Not Delivered,10/3/2021,Pablo,34,14.0,UK,O-555,444772

This is similar to last function.

In [85]:
sales_df.groupby("Product_Category").last()

,OrderID,Quantity,UnitPrice(USD),Status,OrderDate,Sales_Manager,Shipping_Cost(USD),Delivery_Time(Days),Shipping_Address,Product_Code,OrderCode
Product_Category,,,,,,,,,,,
Entertainment,1.468010e+18,53,229,Delivered,7/12/2021,Anthony,25,12.0,Singapore,ENT-630,443889
Fashion,2.281610e+18,18,117,Shipped,12/23/2021,Stella,22,24.0,Italy,F-101,445553
Healthcare,1.847410e+18,37,135,Shipped,10/3/2021,Maria,30,23.0,China,HC-901,444772
Home,2.301610e+18,75,201,Not Delivered,10/16/2021,Sofia,20,14.0,Kenya,H-555,444885
Office,2.385710e+18,81,207,Delivered,11/13/2021,Emma,29,18.0,USA,O-203,445113

Interstingly, you can select to view specific row of each group using `nth()` function. Lets see how!

In [86]:
sales_df.groupby("Product_Category").nth(3)

,OrderID,Quantity,UnitPrice(USD),Status,OrderDate,Sales_Manager,Shipping_Cost(USD),Delivery_Time(Days),Shipping_Address,Product_Code,OrderCode
Product_Category,,,,,,,,,,,
Entertainment,4.030410e+18,21,123,Not Delivered,10/10/2021,Kristen,30,15.0,India,ENT-188,444779
Fashion,2.804110e+18,31,163,Not Shipped,12/23/2021,Abdul,34,16.0,Kenya,F-901,445553
Healthcare,4.276410e+18,83,224,Not Delivered,7/10/2021,Sofia,24,24.0,Kenya,HC-203,443887
Home,3.105110e+18,79,213,Delivered,10/26/2021,Abdul,27,14.0,China,H-203,444995
Office,1.444810e+18,5,119,Not Shipped,10/13/2021,Stella,33,20.0,India,O-555,444882

We can find the `size()` of each group which is the number of rows in each `Product_Category`

In [87]:
sales_df.groupby("Product_Category").size().reset_index()

  Product_Category     0
0    Entertainment  1968
1          Fashion  1971
2       Healthcare  1953
3             Home  2060
4           Office  2011

Also, we can use the `count()` for the same purpose.

In [88]:
sales_df.groupby("Product_Category").count().reset_index()

,Product_Category,OrderID,Quantity,UnitPrice(USD),Status,OrderDate,Sales_Manager,Shipping_Cost(USD),Delivery_Time(Days),Shipping_Address,Product_Code,OrderCode
0,Entertainment,1968,1968,1968,1968,1968,1968,1968,1959,1968,1968,1968
1,Fashion,1971,1971,1971,1971,1971,1971,1971,1963,1971,1971,1971
2,Healthcare,1953,1953,1953,1953,1953,1953,1953,1937,1953,1953,1953
3,Home,2060,2060,2060,2060,2060,2060,2060,2049,2060,2060,2060
4,Office,2011,2011,2011,2011,2011,2011,2011,2004,2011,2011,2011

`.count()` counts only the non-null values from each column, whereas `.size()` simply returns the number of rows available in each group irrespective of presence or absence of values.

`GroupBy` method `get_group()` is used to select or extract only one group from the `GroupBy` object.

In [89]:
sales_gp_df.get_group('Healthcare').head(10)

,OrderID,Quantity,UnitPrice(USD),Status,OrderDate,Product_Category,Sales_Manager,Shipping_Cost(USD),Delivery_Time(Days),Shipping_Address,Product_Code,OrderCode
0,2.951110e+18,92,238,Not Delivered,8/8/2021,Healthcare,Pablo,21,25.0,Singapore,HC-188,444116
6,2.750410e+18,73,242,Not Delivered,7/8/2021,Healthcare,Emma,34,10.0,UK,HC-555,443885
14,2.559910e+18,55,233,Not Delivered,7/15/2021,Healthcare,Kristen,25,18.0,India,HC-555,443992
19,4.276410e+18,83,224,Not Delivered,7/10/2021,Healthcare,Sofia,24,24.0,Kenya,HC-203,443887
22,2.111510e+18,74,250,Delivered,12/8/2021,Healthcare,Maria,25,21.0,Italy,HC-901,445338
24,3.509310e+18,8,119,Shipped,11/1/2021,Healthcare,Jacob,32,10.0,UK,HC-188,445001
30,1.408910e+18,7,130,Delivered,7/4/2021,Healthcare,Sofia,20,NaN,UK,HC-630,443881
40,3.353310e+18,68,224,Not Shipped,12/30/2021,Healthcare,Anthony,31,23.0,Singapore,HC-188,445660
41,4.473810e+18,10,230,Not Delivered,11/1/2021,Healthcare,Jacob,31,12.0,Kenya,HC-101,445001
45,3.199510e+18,49,220,Not Shipped,12/6/2021,Healthcare,Jacob,32,19.0,Italy,HC-901,445336

Now, we are viewing only rows with `Product_Category` is `Healthcare`

Also, remember that the `GroupBy` object is nothig but a `dict` and you can iterate over it.

In [90]:
for gp_name, gp_contents in sales_gp_df:
    print(gp_name)
    display(gp_contents.head())

Entertainment

,OrderID,Quantity,UnitPrice(USD),Status,OrderDate,Product_Category,Sales_Manager,Shipping_Cost(USD),Delivery_Time(Days),Shipping_Address,Product_Code,OrderCode
5,4.934810e+18,51,204,Not Delivered,11/13/2021,Entertainment,Abdul,32,18.0,UK,ENT-188,445113
12,3.882310e+18,78,219,Delivered,10/29/2021,Entertainment,Emma,24,19.0,USA,ENT-901,444998
20,2.469010e+18,15,156,Shipped,12/13/2021,Entertainment,Pablo,29,19.0,Germany,ENT-101,445443
21,4.030410e+18,21,123,Not Delivered,10/10/2021,Entertainment,Kristen,30,15.0,India,ENT-188,444779
23,3.629310e+18,78,155,Delivered,12/2/2021,Entertainment,Anthony,35,12.0,China,ENT-188,445332

Fashion

,OrderID,Quantity,UnitPrice(USD),Status,OrderDate,Product_Category,Sales_Manager,Shipping_Cost(USD),Delivery_Time(Days),Shipping_Address,Product_Code,OrderCode
3,1.112610e+18,33,133,Not Shipped,7/30/2021,Fashion,Abdul,34,24.0,USA,F-555,444007
4,1.548310e+18,13,189,Not Delivered,8/15/2021,Fashion,Stella,24,19.0,Kenya,F-555,444223
7,4.797510e+18,48,240,Delivered,10/4/2021,Fashion,Abdul,22,21.0,Kenya,F-203,444773
8,2.804110e+18,31,163,Not Shipped,12/23/2021,Fashion,Abdul,34,16.0,Kenya,F-901,445553
9,1.735910e+18,62,214,Not Delivered,8/14/2021,Fashion,John,22,17.0,Germany,F-901,444222

Healthcare

,OrderID,Quantity,UnitPrice(USD),Status,OrderDate,Product_Category,Sales_Manager,Shipping_Cost(USD),Delivery_Time(Days),Shipping_Address,Product_Code,OrderCode
0,2.951110e+18,92,238,Not Delivered,8/8/2021,Healthcare,Pablo,21,25.0,Singapore,HC-188,444116
6,2.750410e+18,73,242,Not Delivered,7/8/2021,Healthcare,Emma,34,10.0,UK,HC-555,443885
14,2.559910e+18,55,233,Not Delivered,7/15/2021,Healthcare,Kristen,25,18.0,India,HC-555,443992
19,4.276410e+18,83,224,Not Delivered,7/10/2021,Healthcare,Sofia,24,24.0,Kenya,HC-203,443887
22,2.111510e+18,74,250,Delivered,12/8/2021,Healthcare,Maria,25,21.0,Italy,HC-901,445338

Home

,OrderID,Quantity,UnitPrice(USD),Status,OrderDate,Product_Category,Sales_Manager,Shipping_Cost(USD),Delivery_Time(Days),Shipping_Address,Product_Code,OrderCode
10,4.337210e+18,57,226,Not Shipped,9/27/2021,Home,John,24,14.0,UK,H-555,444666
13,4.583610e+18,46,208,Not Shipped,7/28/2021,Home,Jacob,29,19.0,UK,H-188,444005
16,2.808810e+18,96,115,Delivered,10/17/2021,Home,Jacob,30,25.0,Kenya,H-901,444886
18,3.105110e+18,79,213,Delivered,10/26/2021,Home,Abdul,27,14.0,China,H-203,444995
26,2.958410e+18,53,141,Shipped,10/29/2021,Home,Pablo,34,18.0,Italy,H-203,444998

Office

,OrderID,Quantity,UnitPrice(USD),Status,OrderDate,Product_Category,Sales_Manager,Shipping_Cost(USD),Delivery_Time(Days),Shipping_Address,Product_Code,OrderCode
1,2.181910e+18,61,136,Not Delivered,10/3/2021,Office,Pablo,34,14.0,UK,O-555,444772
2,3.239110e+18,67,235,Not Delivered,9/27/2021,Office,Kristen,25,11.0,Kenya,O-188,444666
11,2.596010e+18,44,246,Delivered,7/11/2021,Office,Stella,20,12.0,Kenya,O-555,443888
15,1.444810e+18,5,119,Not Shipped,10/13/2021,Office,Stella,33,20.0,India,O-555,444882
25,3.063710e+18,100,173,Not Delivered,12/22/2021,Office,Jacob,21,23.0,Germany,O-630,445552

Easy and simple! Keep in mind this aspect for `GroupBy` objects. It can be game-changing when dealing with large dataset!

# Data Buketing
This is a typical data pre-processing method sometimes called binning, often referred to as bucketing or discretization, groups intervals of continuous data into `bins` or `buckets`

Now, we will demostrate 3 methods for `Bucketing`: 

* A combination between `.loc` and `.between` method can be used for this task.`.between` method returns a boolean vector containing True wherever the corresponding Series element is between the boundary values left and right. Check [documentation](https://pandas.pydata.org/docs/reference/api/pandas.Series.between.html) but the most important arguments are as following:
    * `left`: left boundary
    * `right`: right boundary
    * `inclusive`: Which boundary to include. Acceptable values are {“both”, “neither”, “left”, “right”}.
    
* `pd.cut()` can be also used to bin values into discrete intervals. Use cut when you need to segment and sort data values into bins. This function is also useful for going from a continuous variable to a categorical variable. Check [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.cut.html). Its main arguments are as following: 
    * `x`: The input array to be binned. Must be 1-dimensional.
    * `bins`: Sequence of scalars : Defines the bin edges allowing for non-uniform width.
    * `labels`: Specifies the labels for the returned bins. Must be the same length as the resulting bins.
    * `include_lowest`: (bool) Whether the first interval should be left-inclusive or not.
    
* `pd.qcut()` can be used to do quantile-based discretization function. Discretize variable into equal-sized buckets based on rank or based on sample quantiles. Check [documentation](https://pandas.pydata.org/docs/reference/api/pandas.qcut.html). Its main arguements are as following: 
    * `x`: The input array to be binned. Must be 1-dimensional.
    * `q`: Number of quantiles. 10 for deciles, 4 for quartiles, etc. Alternately array of quantiles, e.g. [0, .25, .5, .75, 1.] for quartiles.
    * `labels`: Specifies the labels for the returned bins. Must be the same length as the resulting bins.
    * `retbins`: (bool) Whether to return the (bins, labels) or not. Can be useful if bins is given as a scalar.

To demonstrate the above methods, we will use a dataset named `banking_clients` which is revealing the total transcations that have been made by some clients and associated with their account numbers. Our job is to add a customer life time value flag `clv_flg` that indicates the importance of every client based on the amount in the transactions! 

Lets apply!

In [91]:
# read the data
banking_df = pd.read_csv('../input/data-analytics/banking_clients.csv')
# view it
banking_df.head()

   account_number   client_name  total_transactions
0          141962    Herman LLC            63626.03
1          146832  Kiehn-Spinka            99608.77
2          163416   Purdy-Kunde            77898.21
3          218895     Kulas Inc           137351.96
4          239344    Stokes LLC            91535.92

Lets use `df.describe()` to see the range of values in the `total_transactions` columns.

In [92]:
banking_df.describe()

       account_number  total_transactions
count        20.00000           20.000000
mean     476998.75000       101711.287500
std      231499.20897        27037.449673
min      141962.00000        55733.050000
25%      252734.50000        89137.707500
50%      476006.50000       100271.535000
75%      695352.25000       110132.552500
max      786968.00000       184793.700000

So, lets make the folloing bucketing for clients based on `total_transactions` as follows: 
- (55700, 90000] --> low
- (90000, 120000] --> medium
- (120000, 200000] --> high

Note: square brackets [ and round brackets )indicates that the boundary value is inclusive and exclusive respectively.

In [93]:
# low bucket
banking_df.loc[banking_df['total_transactions'].between(55700, 90000, 'right'), 'clv_flg_v1'] = 'low'
# medium bucket
banking_df.loc[banking_df['total_transactions'].between(90000, 120000, 'right'), 'clv_flg_v1'] = 'medium'
# high bucket
banking_df.loc[banking_df['total_transactions'].between(120000, 200000, 'right'), 'clv_flg_v1'] = 'high'

# lets see our dataset
banking_df.head()

   account_number   client_name  total_transactions clv_flg_v1
0          141962    Herman LLC            63626.03        low
1          146832  Kiehn-Spinka            99608.77     medium
2          163416   Purdy-Kunde            77898.21        low
3          218895     Kulas Inc           137351.96       high
4          239344    Stokes LLC            91535.92     medium

Lets see how many clients in each category.

In [94]:
banking_df.clv_flg_v1.value_counts()

medium    11
low        6
high       3
Name: clv_flg_v1, dtype: int64

Now, lets apply `pd.cut()`!

In [95]:
# create bins list (it should have one element more than the labels list)
bins = [55700, 90000, 120000, 200000 ]
# create labels list
labels = ['low', 'medium', 'high']
# apply pd.cut()
banking_df['clv_flg_v2'] = pd.cut(x=banking_df['total_transactions'], bins = bins, labels = labels, include_lowest=True)
# lets see the result
banking_df.head()

   account_number   client_name  total_transactions clv_flg_v1 clv_flg_v2
0          141962    Herman LLC            63626.03        low        low
1          146832  Kiehn-Spinka            99608.77     medium     medium
2          163416   Purdy-Kunde            77898.21        low        low
3          218895     Kulas Inc           137351.96       high       high
4          239344    Stokes LLC            91535.92     medium     medium

Now, lets verify the number of clients

In [96]:
banking_df.clv_flg_v2.value_counts()

medium    11
low        6
high       3
Name: clv_flg_v2, dtype: int64

It is the same as the above method!

Now, lets try `pd.qcut()` which will try to make equal bins as much as it can.

In [97]:
# define labels
labels_qcut = ['Bronze', 'Silver', 'Gold', 'Titanium', 'Platinum ']
# apply `pd.qcut()`
banking_df['clv_flg_v3'] = pd.qcut(banking_df['total_transactions'], q= 5,
                                   labels = labels_qcut)
# lets see it!
banking_df.head()

,account_number,client_name,total_transactions,clv_flg_v1,clv_flg_v2,clv_flg_v3
0,141962,Herman LLC,63626.03,low,low,Bronze
1,146832,Kiehn-Spinka,99608.77,medium,medium,Gold
2,163416,Purdy-Kunde,77898.21,low,low,Bronze
3,218895,Kulas Inc,137351.96,high,high,Platinum
4,239344,Stokes LLC,91535.92,medium,medium,Silver

`pd.qcut()` has an intersting property which is returing the upper and lower boundry for each category using `retbine=True` argument. 

Lets see how!

In [98]:
banking_df['clv_flg_v3'], cut_bins = pd.qcut(banking_df['total_transactions'], q= 5,
                                   labels = labels_qcut, 
                                   retbins=True)
# lets see it!
banking_df.head()

,account_number,client_name,total_transactions,clv_flg_v1,clv_flg_v2,clv_flg_v3
0,141962,Herman LLC,63626.03,low,low,Bronze
1,146832,Kiehn-Spinka,99608.77,medium,medium,Gold
2,163416,Purdy-Kunde,77898.21,low,low,Bronze
3,218895,Kulas Inc,137351.96,high,high,Platinum
4,239344,Stokes LLC,91535.92,medium,medium,Silver

Lets print `cut_bins`

In [99]:
cut_bins

array([ 55733.05 ,  87167.958,  95908.156, 103605.97 , 112290.054,
       184793.7  ])

lets find our some more organized way for viewing it.

In [100]:
threshold_category_table = pd.DataFrame(zip(cut_bins, labels_qcut), columns = ['Theshold', 'Category'])
# check the result
threshold_category_table

     Theshold   Category
0   55733.050     Bronze
1   87167.958     Silver
2   95908.156       Gold
3  103605.970   Titanium
4  112290.054  Platinum

# Merging

Merging or Joins in a database jargon is an essential skill to master in the field of data in general. It's simply all about matching two tables together using some linkage key in different ways for different purposes. If you don't know much about the Join concept, I recommend reading this [article](https://www.javatpoint.com/types-of-sql-join)

For this tutorial, we will be stricted to joining using pandas or merging in pandas languge. I highly recommend reading this [article](https://pandas.pydata.org/docs/user_guide/merging.html) about pandas espcifically. 

The basic syntax of merging is as follows: 

```Python
pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)
```

Most of those arguments are easy to approach and will be touched in the examples

### Excercise
we have now 3 datasets that are coming from some telco operator
- `user_usage`: provides some info about the use such as outgoing minutes, SMSs, and MBs and they are associated with specific *use_id*.
- `user_device`: provides some info about the user and the device he used to make such use on the telco operator all rows are associated with specific *use_id* and *user_id*
- `android_devices`: provides some info about the android phone devices themselves such as the model of each phone.

In [101]:
# read user_usage
user_usage_df = pd.read_csv('../input/data-analytics/user_usage.csv')
# Let's view it 
user_usage_df.head()

   outgoing_mins_per_month  outgoing_sms_per_month  monthly_mb  use_id
0                    21.97                    4.82     1557.33   22787
1                  1710.08                  136.88     7267.55   22788
2                  1710.08                  136.88     7267.55   22789
3                    94.46                   35.17      519.12   22790
4                    71.59                   79.26     1557.33   22792

In [102]:
# read user_device 
user_device_df = pd.read_csv('../input/data-analytics/user_device.csv')
# Let's view it
user_device_df.head()

   use_id  user_id platform  platform_version     device  use_type_id
0   22782    26980      ios              10.2  iPhone7,2            2
1   22783    29628  android               6.0    Nexus 5            3
2   22784    28473  android               5.1   SM-G903F            1
3   22785    15200      ios              10.2  iPhone7,2            3
4   22786    28239  android               6.0  ONE E1003            1

In [103]:
# read android_devices
devices_df = pd.read_csv('../input/data-analytics/android_devices.csv')
# Let's view it
devices_df.head()

  Retail Branding Marketing Name    Device                      Model
0             NaN            NaN    AD681H  Smartfren Andromax AD681H
1             NaN            NaN     FJL21                      FJL21
2             NaN            NaN       T31              Panasonic T31
3             NaN            NaN  hws7721g         MediaPad 7 Youth 2
4              3Q        OC1020A   OC1020A                    OC1020A

Now, we want to add some info to the `user_usage_df` such as the `platform` and `device` from the `user_device_df` using the `use_id`

In [104]:
# merge user_usage_df and user_device_df
usage_device = pd.merge(user_usage_df,
                 user_device_df[['use_id', 'platform', 'device']],
                 how='left',
                 on='use_id')
usage_device.head()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device
0,21.97,4.82,1557.33,22787,android,GT-I9505
1,1710.08,136.88,7267.55,22788,android,SM-G930F
2,1710.08,136.88,7267.55,22789,android,SM-G930F
3,94.46,35.17,519.12,22790,android,D2303
4,71.59,79.26,1557.33,22792,android,SM-G361F

At first glance, this may seem perfect, all is not as it seems. Lets check how many `use_id` in `user_usage_df` found matches in `user_device_df`

One of the great arguments in `pd.merge()` is `indicator=True`. It adds a boolean flag that indicate if this row in the left dataframe found a match in the right dataframe or not. 

Lets try it!

In [105]:
# merge user_usage_df and user_device_df
usage_device_ind = pd.merge(user_usage_df,
                 user_device_df[['use_id', 'platform', 'device']],
                 how='left',
                 on='use_id', 
                 indicator=True)
usage_device_ind.head()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device,_merge
0,21.97,4.82,1557.33,22787,android,GT-I9505,both
1,1710.08,136.88,7267.55,22788,android,SM-G930F,both
2,1710.08,136.88,7267.55,22789,android,SM-G930F,both
3,94.46,35.17,519.12,22790,android,D2303,both
4,71.59,79.26,1557.33,22792,android,SM-G361F,both

Lets see the `value_counts()` of the indicator column.

In [106]:
usage_device_ind._merge.value_counts()

both          159
left_only      81
right_only      0
Name: _merge, dtype: int64

As you can see, `159` row in the left found a match from the right while `81` were found in the left only.

We can validate this by using `.isin()` function

In [107]:
user_usage_df['use_id'].isin(user_device_df['use_id']).value_counts()

True     159
False     81
Name: use_id, dtype: int64

Lets add some more info from `devices_df` to the `usage_device` newly created dataframe.

In [108]:
user_usage_device_ind = pd.merge(usage_device, 
                             devices_df, 
                             how='left', 
                             left_on='device', 
                             right_on='Device', 
                             indicator=True)

user_usage_device_ind.head()

,outgoing_mins_per_month,outgoing_sms_per_month,monthly_mb,use_id,platform,device,Retail Branding,Marketing Name,Device,Model,_merge
0,21.97,4.82,1557.33,22787,android,GT-I9505,NaN,NaN,NaN,NaN,left_only
1,1710.08,136.88,7267.55,22788,android,SM-G930F,NaN,NaN,NaN,NaN,left_only
2,1710.08,136.88,7267.55,22789,android,SM-G930F,NaN,NaN,NaN,NaN,left_only
3,94.46,35.17,519.12,22790,android,D2303,Sony,Xperia M2,D2303,D2303,both
4,71.59,79.26,1557.33,22792,android,SM-G361F,NaN,NaN,NaN,NaN,left_only

Here, you will notice that we used two new arguments `left_on` and `right_on` . That's because the naming of the linkage column is different from the left and right dataset.

Lets see some more statistics about the merging process.

In [109]:
user_usage_device_ind._merge.value_counts()

left_only     223
both           19
right_only      0
Name: _merge, dtype: int64

Only `19` devices we matched between the two datasets!

This notebook is part of my `Python for Data Analysis` course. If you find it useful, you can upvote it! Also, you can follow me on [LinkedIn](https://www.linkedin.com/in/aaabulkhair/) and [Twitter](https://twitter.com/aaabulkhair_). 

Below are the contents of the whole course: 
1. [Introduction to Python](https://www.kaggle.com/code/ahmedabdulhamid/1-introduction-to-python)
2. [Iterative Operations & Functions in Python](https://www.kaggle.com/code/ahmedabdulhamid/2-iterative-operations-functions-in-python)
3. [Introduction to NumPy](https://www.kaggle.com/code/ahmedabdulhamid/3-introduction-to-numpy/)
4. [Data Transformation using Pandas](https://www.kaggle.com/ahmedabdulhamid/4-data-transformation-using-pandas/), This Notebook.